# CurveThrough

## Description
Procedure CurveThrough fits a cubic spline through the specified point.&lt;BR&gt;

```pascal
PROCEDURE CurveThrough(p : REAL);
```

```python

def vs.CurveThrough(p):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p|REAL|Coordinates of vertex.|

## Version
Availability: from MiniCAD4.0
## Category
* Objects - Polys